Config/Documents/ЛистКассовойКнигиФондовый_52н.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛистКассовойКнигиФондовый_52н</Name>
			<Comment>Отчет кассира (Фондовый)</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВсегоПриход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегоРасход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьКаждуюПроводку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кассир</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЛистов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецДняБюджет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецДняВнеБюдж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоДняБюджет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоДняВнеБюдж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЛиста</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнийДеньМесяца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриходБюджет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриходВнеБюдж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходБюджет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходВнеБюдж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриходУчреждение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходУчреждение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриходВремРасп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходВремРасп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоДняУчреждение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоДняВремРасп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецДняУчреждение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецДняВремРасп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КассовыеОрдера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КассовыйДокумент</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриходныйОрдерФондовый</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйОрдерФондовый</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтКогоКому</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСчет</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриходБюджет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходБюджет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриходВнеБюдж</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходВнеБюдж</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриходУчреждение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходУчреждение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриходВремРасп</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходВремРасп</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Documents/ЛистКассовойКнигиФондовый_52н/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция проверяет существование листа кассовой книги на дату
// текущего объекта.
// 
// Возвращаемое значение: 
// Булево.
// Истина - существует другой лист кассовой книги за этот день,
// Ложь - не существует.
// 
Функция СуществуетДокументЗаЭтотДень() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ЛистКассовойКнигиФондовый.Ссылка
	|ИЗ
	|	Документ.ЛистКассовойКнигиФондовый КАК ЛистКассовойКнигиФондовый
	|ГДЕ
	|	ЛистКассовойКнигиФондовый.Организация = &Организация
	|	И НАЧАЛОПЕРИОДА(ЛистКассовойКнигиФондовый.Дата, ДЕНЬ) = &Дата
	|	И ЛистКассовойКнигиФондовый.Ссылка <> &Ссылка
	|	И (&ЕстьПодразделение
	|				И ЛистКассовойКнигиФондовый.Подразделение = &Подразделение
	|			ИЛИ НЕ &ЕстьПодразделение
	|				И (ЛистКассовойКнигиФондовый.Подразделение ЕСТЬ NULL 
	|					ИЛИ ЛистКассовойКнигиФондовый.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЛистКассовойКнигиФондовый.Ссылка
	|ИЗ
	|	Документ.ЛистКассовойКнигиФондовый_52н КАК ЛистКассовойКнигиФондовый
	|ГДЕ
	|	ЛистКассовойКнигиФондовый.Организация = &Организация
	|	И НАЧАЛОПЕРИОДА(ЛистКассовойКнигиФондовый.Дата, ДЕНЬ) = &Дата
	|	И ЛистКассовойКнигиФондовый.Ссылка <> &Ссылка
	|	И (&ЕстьПодразделение
	|				И ЛистКассовойКнигиФондовый.Подразделение = &Подразделение
	|			ИЛИ НЕ &ЕстьПодразделение
	|				И (ЛистКассовойКнигиФондовый.Подразделение ЕСТЬ NULL 
	|					ИЛИ ЛистКассовойКнигиФондовый.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЛистКассовойКнигиФондовый.Ссылка
	|ИЗ
	|	Документ.ЛистКассовойКнигиФондовый КАК ЛистКассовойКнигиФондовый
	|ГДЕ
	|	ЛистКассовойКнигиФондовый.Организация = &Организация
	|	И НАЧАЛОПЕРИОДА(ЛистКассовойКнигиФондовый.Дата, ДЕНЬ) > &Дата
	|	И ЛистКассовойКнигиФондовый.Ссылка <> &Ссылка
	|	И (&ЕстьПодразделение
	|				И ЛистКассовойКнигиФондовый.Подразделение = &Подразделение
	|			ИЛИ НЕ &ЕстьПодразделение
	|				И (ЛистКассовойКнигиФондовый.Подразделение ЕСТЬ NULL 
	|					ИЛИ ЛистКассовойКнигиФондовый.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)))";
				 
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Дата",				НачалоДня(Дата));
	Запрос.УстановитьПараметр("Ссылка",				Ссылка);
	Запрос.УстановитьПараметр("Подразделение",		Подразделение);
	Запрос.УстановитьПараметр("ЕстьПодразделение",	ЗначениеЗаполнено(Подразделение));    

	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции //СуществуетДокументЗаЭтотДень()

// Процедура заполняет строки документа. 
// 
// Параметры: 
// Объект - Документ объект - документ для заполнения
// 
Процедура ЗаполнитьДокумент() Экспорт
	
	КассаОрганизации.ЗаполнитьОтчетКассираФондовый(ЭтотОбъект);
	
КонецПроцедуры //ЗаполнитьДокумент()

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если СуществуетДокументЗаЭтотДень() Тогда
		
		ТекстСообщения = НСтр("ru = 'Отчет кассира (Фондовый) за "+Формат(ЭтотОбъект.Дата,"ДФ=dd.MM.yyyy")+" уже создан,
		|или существует отчет кассира по инстр. 173н, созданный более поздней датой.'");

		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Объект.Дата",, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры //ПередЗаписью()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ТаблицаДокумента = КассовыеОрдера.Выгрузить(,"НомерСтроки, КассовыйДокумент");
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.КассовыйДокумент
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	&ТаблицаДокумента КАК ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.КассовыйДокумент,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ТаблицаДокумента.КассовыйДокумент ССЫЛКА Документ.ПриходныйОрдерФондовый
	|				ТОГДА ПриходныйОрдерФондовый.Проведен
	|			КОГДА ТаблицаДокумента.КассовыйДокумент ССЫЛКА Документ.РасходныйОрдерФондовый
	|				ТОГДА РасходныйОрдерФондовый.Проведен
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК Проведен,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ТаблицаДокумента.КассовыйДокумент ССЫЛКА Документ.ПриходныйОрдерФондовый
	|				ТОГДА ПриходныйОрдерФондовый.Оплачено
	|			КОГДА ТаблицаДокумента.КассовыйДокумент ССЫЛКА Документ.РасходныйОрдерФондовый
	|				ТОГДА РасходныйОрдерФондовый.Оплачено
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК Оплачено,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.КассовыйДокумент ССЫЛКА Документ.ПриходныйОрдерФондовый
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(ПриходныйОрдерФондовый.Ссылка)
	|		КОГДА ТаблицаДокумента.КассовыйДокумент ССЫЛКА Документ.РасходныйОрдерФондовый
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(РасходныйОрдерФондовый.Ссылка)
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Представление
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходныйОрдерФондовый КАК ПриходныйОрдерФондовый
	|		ПО ТаблицаДокумента.КассовыйДокумент = ПриходныйОрдерФондовый.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерФондовый КАК РасходныйОрдерФондовый
	|		ПО ТаблицаДокумента.КассовыйДокумент = РасходныйОрдерФондовый.Ссылка
	|ГДЕ
	|	(ВЫБОР
	|				КОГДА ТаблицаДокумента.КассовыйДокумент ССЫЛКА Документ.ПриходныйОрдерФондовый
	|					ТОГДА ПриходныйОрдерФондовый.Проведен
	|				КОГДА ТаблицаДокумента.КассовыйДокумент ССЫЛКА Документ.РасходныйОрдерФондовый
	|					ТОГДА РасходныйОрдерФондовый.Проведен
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ = ЛОЖЬ
	|			ИЛИ ВЫБОР
	|				КОГДА ТаблицаДокумента.КассовыйДокумент ССЫЛКА Документ.ПриходныйОрдерФондовый
	|					ТОГДА ПриходныйОрдерФондовый.Оплачено
	|				КОГДА ТаблицаДокумента.КассовыйДокумент ССЫЛКА Документ.РасходныйОрдерФондовый
	|					ТОГДА РасходныйОрдерФондовый.Оплачено
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ = ЛОЖЬ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.КассовыйДокумент,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.КассовыйДокумент ССЫЛКА Документ.ПриходныйОрдерФондовый
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(ПриходныйОрдерФондовый.Ссылка)
	|		КОГДА ТаблицаДокумента.КассовыйДокумент ССЫЛКА Документ.РасходныйОрдерФондовый
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(РасходныйОрдерФондовый.Ссылка)
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ";
	
	// запрос не получает никаких данных - можно отключить RLS
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос.УстановитьПараметр("ТаблицаДокумента", ТаблицаДокумента);
	Выборка = Запрос.Выполнить().Выбрать();
	Отказ = Выборка.Количество() > 0 ;
	
	Если Отказ Тогда
		// очистим проверяемые реквизиты, чтобы не было лишних сообщений об ошибках
		
		ОшибкаПроведен = НСтр("ru = 'Документ %1 не проведен'");
		ОшибкаОплачено = НСтр("ru = 'Документ %1 не оплачен'");
		Пока Выборка.Следующий() Цикл
			
			Если НЕ Выборка.Оплачено Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОшибкаОплачено, Выборка.Представление);
			Иначе
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОшибкаПроведен, Выборка.Представление);
			КонецЕсли;
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Выборка.КассовыйДокумент);
			
		КонецЦикла;
		
		ПроверяемыеРеквизиты.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	КассовыеОрдера.Очистить();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
